app/Views/hitung.php

		foreach ($krta as $r) {
			echo "<tr><td>" . $r->nama_kriteria . "</td>";
			foreach ($krta as $r2) {
				$dt = $db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();
---
SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'

			$n = 0;
			foreach ($krta as $r2) {
				$n++;
				$dt = $db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();
---
SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'

		foreach ($krta as $r) {
			echo "<tr><td>K" . $r->id_kriteria . "</td>";
			foreach ($krta as $r2) {
				$dt = $db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();
---
SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'

			echo "<tr><td>K" . $r->id_kriteria . "</td>";
			$jum = 0;
			foreach ($krta as $r2) {
				$dt = $db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();
---
SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'

			foreach ($alt as $r2) {
				echo "<tr><td>" . $r2->nama . "</td>";
				foreach ($alt as $r3) {
					$dt = $db->table("tbl_bobotalt")->where(["kriteria" => $r->id_kriteria, "alternatif1" => $r2->id, "alternatif2" => $r3->id])->get()->getRow();
---
SELECT *
FROM `tbl_bobotalt`
WHERE `kriteria` = '1'
AND `alternatif1` = '0135215651'
AND `alternatif2` = '0135215651'